---
kind: method
id: M:Autodesk.Revit.DB.View.GetReferenceElevations
zh: 视图
source: html/a029f626-b771-176c-09e6-8a58437c6efe.htm
---
# Autodesk.Revit.DB.View.GetReferenceElevations Method

**中文**: 视图

Returns element ids of all reference elevations in the view.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetReferenceElevations()
```

## Returns
Element ids of all reference elevations in the view.